# IsRectangularRegion Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructure..::..IsRectangularRegion Method
CompoundStructure Class See Also
---
Determines whether the specified region is rectangular.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsRectangularRegion(
	int regionId
)
```

Visual Basic
---
```text
Public Function IsRectangularRegion ( _
	regionId As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool IsRectangularRegion(
	int regionId
)
```

# ### Parameters
regionId
    Type: System..::..Int32 The id of a region.
# ### Return Value
True if the specified region is a rectangle, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | It is not a valid region id. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This operation is valid only for vertically compound structures. |

# See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace